RedditApp/app/controllers/application_controller.rb

  def current_user
    User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "Qcri0wEARu7J3kvDGCYQ8A"], ["LIMIT", 1]]