RedditApp/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    # @post.sub_ids = params[:sub_ids]
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "rhfbtb"], ["url", "dadawdw"], ["content", "sefea"], ["user_id", 2], ["created_at", "2019-07-09 20:24:03.995721"], ["updated_at", "2019-07-09 20:24:03.995721"]]

  def update
    @post = User.posts.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]