RedditApp/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "egsege"], ["description", "sesgseg"], ["user_id", 11], ["created_at", "2019-07-09 17:46:53.288967"], ["updated_at", "2019-07-09 17:46:53.288967"]]
---
  def create
    @sub = Sub.new(sub_params)
     @sub.user_id = current_user.id
     if @sub.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def update
    @sub = User.subs.find(params[:id])